Bump_ALE/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  70860.;

boundaryField
{

    my-velocity-inlet
    {
        type            totalPressure;
        p0              uniform 116700;
        value           uniform 116700;
    }

    my-pressure-outlet
    {
        type            fixedMean;
        meanValue       uniform 67978.;
        value           uniform 67978.;
    }
    
    my-wall
    {
        type            zeroGradient;
    }

    "(frontLeftPlane|frontRightPlane|frontBump|backLeftPlane|backRightPlane|backBump)"
    {
        type            cyclic;
    }
    
    freeSurf
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
